gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_adc.h
/*!
    \file    gd32f527_adc.h
    \brief   definitions for the ADC
    
    \version 2026-01-31, V1.4.0, firmware for GD32F527
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32F527_ADC_H
#define GD32F527_ADC_H

#include "gd32f527.h"

/* ADC definitions */
#define ADC0                            ADC_BASE
#define ADC1                            (ADC_BASE + 0x100U)
#define ADC2                            (ADC_BASE + 0x200U)

/* registers definitions */
#define ADC_STAT(adcx)                  REG32((adcx) + 0x00U)                       /*!< ADC status register */
#define ADC_CTL0(adcx)                  REG32((adcx) + 0x04U)                       /*!< ADC control register 0 */
#define ADC_CTL1(adcx)                  REG32((adcx) + 0x08U)                       /*!< ADC control register 1 */
#define ADC_SAMPT0(adcx)                REG32((adcx) + 0x0CU)                       /*!< ADC sampling time register 0 */
#define ADC_SAMPT1(adcx)                REG32((adcx) + 0x10U)                       /*!< ADC sampling time register 1 */
#define ADC_IOFF0(adcx)                 REG32((adcx) + 0x14U)                       /*!< ADC inserted channel data offset register 0 */
#define ADC_IOFF1(adcx)                 REG32((adcx) + 0x18U)                       /*!< ADC inserted channel data offset register 1 */
#define ADC_IOFF2(adcx)                 REG32((adcx) + 0x1CU)                       /*!< ADC inserted channel data offset register 2 */
#define ADC_IOFF3(adcx)                 REG32((adcx) + 0x20U)                       /*!< ADC inserted channel data offset register 3 */
#define ADC_WDHT(adcx)                  REG32((adcx) + 0x24U)                       /*!< ADC watchdog high threshold register */
#define ADC_WDLT(adcx)                  REG32((adcx) + 0x28U)                       /*!< ADC watchdog low threshold register */
#define ADC_RSQ0(adcx)                  REG32((adcx) + 0x2CU)                       /*!< ADC routine sequence register 0 */
#define ADC_RSQ1(adcx)                  REG32((adcx) + 0x30U)                       /*!< ADC routine sequence register 1 */
#define ADC_RSQ2(adcx)                  REG32((adcx) + 0x34U)                       /*!< ADC routine sequence register 2 */
#define ADC_ISQ(adcx)                   REG32((adcx) + 0x38U)                       /*!< ADC inserted sequence register */
#define ADC_IDATA0(adcx)                REG32((adcx) + 0x3CU)                       /*!< ADC inserted data register 0 */
#define ADC_IDATA1(adcx)                REG32((adcx) + 0x40U)                       /*!< ADC inserted data register 1 */
#define ADC_IDATA2(adcx)                REG32((adcx) + 0x44U)                       /*!< ADC inserted data register 2 */
#define ADC_IDATA3(adcx)                REG32((adcx) + 0x48U)                       /*!< ADC inserted data register 3 */
#define ADC_RDATA(adcx)                 REG32((adcx) + 0x4CU)                       /*!< ADC routine data register */
#define ADC_OVSAMPCTL(adcx)             REG32((adcx) + 0x80U)                       /*!< ADC oversampling control register */
#define ADC_SSTAT                       REG32((ADC_BASE) + 0x300U)                  /*!< ADC summary status register */
#define ADC_SYNCCTL                     REG32((ADC_BASE) + 0x304U)                  /*!< ADC synchronization control register */
#define ADC_SYNCDATA                    REG32((ADC_BASE) + 0x308U)                  /*!< ADC synchronization routine data register */

/* bits definitions */
/* ADC_STAT */
#define ADC_STAT_WDE                    BIT(0)                                      /*!< analog watchdog event flag */
#define ADC_STAT_EOC                    BIT(1)                                      /*!< end of conversion */
#define ADC_STAT_EOIC                   BIT(2)                                      /*!< inserted channel end of conversion */
#define ADC_STAT_STIC                   BIT(3)                                      /*!< inserted channel start flag */
#define ADC_STAT_STRC                   BIT(4)                                      /*!< routine channel start flag */
#define ADC_STAT_ROVF                   BIT(5)                                      /*!< routine data register overflow */

/* ADC_CTL0 */
#define ADC_CTL0_WDCHSEL                BITS(0,4)                                   /*!< analog watchdog channel select bits */
#define ADC_CTL0_EOCIE                  BIT(5)                                      /*!< interrupt enable for EOC */
#define ADC_CTL0_WDEIE                  BIT(6)                                      /*!< analog watchdog interrupt enable */
#define ADC_CTL0_EOICIE                 BIT(7)                                      /*!< interrupt enable for inserted channels */
#define ADC_CTL0_SM                     BIT(8)                                      /*!< scan mode */
#define ADC_CTL0_WDSC                   BIT(9)                                      /*!< when in scan mode, analog watchdog is effective on a single channel */
#define ADC_CTL0_ICA                    BIT(10)                                     /*!< automatic inserted sequence conversion */
#define ADC_CTL0_DISRC                  BIT(11)                                     /*!< discontinuous mode on routine channels */
#define ADC_CTL0_DISIC                  BIT(12)                                     /*!< discontinuous mode on inserted channels */
#define ADC_CTL0_DISNUM                 BITS(13,15)                                 /*!< discontinuous mode channel count */
#define ADC_CTL0_IWDEN                  BIT(22)                                     /*!< analog watchdog enable on inserted channels */
#define ADC_CTL0_RWDEN                  BIT(23)                                     /*!< analog watchdog enable on routine channels */
#define ADC_CTL0_DRES                   BITS(24,25)                                 /*!< ADC data resolution */
#define ADC_CTL0_ROVFIE                 BIT(26)                                     /*!< interrupt enable for ROVF */ 

/* ADC_CTL1 */
#define ADC_CTL1_ADCON                  BIT(0)                                      /*!< ADC converter on */
#define ADC_CTL1_CTN                    BIT(1)                                      /*!< continuous conversion */
#define ADC_CTL1_CLB                    BIT(2)                                      /*!< ADC calibration */
#define ADC_CTL1_RSTCLB                 BIT(3)                                      /*!< reset calibration */
#define ADC_CTL1_DMA                    BIT(8)                                      /*!< direct memory access mode */
#define ADC_CTL1_DDM                    BIT(9)                                      /*!< DMA disable mode */
#define ADC_CTL1_EOCM                   BIT(10)                                     /*!< end of conversion mode */
#define ADC_CTL1_DAL                    BIT(11)                                     /*!< data alignment */
#define ADC_CTL1_ETSIC                  BITS(16,19)                                 /*!< external event select for inserted sequence */
#define ADC_CTL1_ETMIC                  BITS(20,21)                                 /*!< external trigger conversion mode for inserted channels */
#define ADC_CTL1_SWICST                 BIT(22)                                     /*!< start conversion of inserted channels */
#define ADC_CTL1_ETSRC                  BITS(24,27)                                 /*!< external event select for routine sequence */
#define ADC_CTL1_ETMRC                  BITS(28,29)                                 /*!< external trigger conversion mode for routine channels */
#define ADC_CTL1_SWRCST                 BIT(30)                                     /*!< start conversion of routine channels */

/* ADC_SAMPTx x=0..1 */
#define ADC_SAMPTX_SPTN                 BITS(0,2)                                   /*!< channel x sample time selection */

